---
type: RoofBase
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# RoofBase

`Autodesk.Revit.DB.RoofBase` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSlabShapeEditor | — | `public SlabShapeEditor GetSlabShapeEditor ()` |
| Property | EaveCuts | — | `public EaveCutterType EaveCuts { get ; set ; }` |
| Property | FasciaDepth | — | `public double FasciaDepth { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RoofType | — | `public RoofType RoofType { get ; set ; }` |
| Property | SlabShapeEditor | — | `[ ObsoleteAttribute ("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")] public SlabShapeEditor SlabShapeEditor { get ; }` |